<?php
 
$title = 'Linuxコマンドテスト';
 
$mistake = array(); //正解フラグ管理配列
$p1 = array(); //コマンド入力管理配列
$p2t = array(); //コマンド説明管理配列行
$p2w = array(); //コマンド説明管理配列列
$p2 = array(); //コマンド説明管理配列
$STDIN = file_get_contents('php://stdin');

//init
$q = 0;
$i = 0;
$mistake = array(1,1,1,1,1); //正解フラグ初期化
$p1 = array("cd","pwd","ls","cat","apt-get"); //コマンド入力管理配列初期化
$p2t = array(0,1,2,3,4); //コマンド説明管理配列行
$p2w = array(0,1,2,3); //コマンド説明管理配列列
$p2 = array($p2t,$p2w); //コマンド説明管理配列初期化

$p2[0][0] = "a"; //コマンド入力管理配列初期化
$p2[0][1] = "b"; //コマンド入力管理配列初期化
$p2[0][2] = "c"; //コマンド入力管理配列初期化
$p2[0][3] = "d"; //コマンド入力管理配列初期化

$p2[1][0] = "e"; //コマンド入力管理配列初期化
$p2[1][1] = "f"; //コマンド入力管理配列初期化
$p2[1][2] = "g"; //コマンド入力管理配列初期化
$p2[1][3] = "h"; //コマンド入力管理配列初期化

$p2[2][0] = "i"; //コマンド入力管理配列初期化
$p2[2][1] = "j"; //コマンド入力管理配列初期化
$p2[2][2] = "k"; //コマンド入力管理配列初期化
$p2[2][3] = "l"; //コマンド入力管理配列初期化

$p2[3][0] = "m"; //コマンド入力管理配列初期化
$p2[3][1] = "n"; //コマンド入力管理配列初期化
$p2[3][2] = "o"; //コマンド入力管理配列初期化
$p2[3][3] = "p"; //コマンド入力管理配列初期化

$p2[4][0] = "q"; //コマンド入力管理配列初期化
$p2[4][1] = "r"; //コマンド入力管理配列初期化
$p2[4][2] = "s"; //コマンド入力管理配列初期化
$p2[4][3] = "t"; //コマンド入力管理配列初期化
$answer = $p2[0][0]; //正解の問題を設定

if($mistake[$i] == 1){

    echo '下記コマンドを入力せよ';
	echo nl2br("\n"); //<br />タグが挿入される。
	$o = $p1[$i];
    echo 'コマンド';
	print $o ;

	$line = trim(fgets(STDIN), "\n");
	echo "input=$line\n";

    $input = 1;
     if($input === $p1[$i]){
 
    echo 'コマンド{$p1[i]}の意味を選べ';
	echo nl2br("\n"); //<br />タグが挿入される。
        if($input === $p1[$i]){
            $mistake[$i] = 0;
	    }
         else{
            $mistake[$i] =1;
        }
     }
     else{
      $mistake[$i] = 1;
     }

    $i++;

    if($mistake[$i] == 0){
    }
}
echo nl2br("\n"); //<br />タグが挿入される。
    echo 'FINISH ';
?>